---
kind: property
id: P:Autodesk.Revit.DB.Visual.BumpMap.TextureOffsetLock
source: html/ef04ecdb-39b6-9f93-624c-1c24c1948af0.htm
---
# Autodesk.Revit.DB.Visual.BumpMap.TextureOffsetLock Property

The property labeled "Offset Lock" from the "BumpMap" schema.

## Syntax (C#)
```csharp
public static string TextureOffsetLock { get; }
```

## Remarks
This property is of type "AssetPropertyBoolean".